package com.choucheng.dengdao2.common;



public interface Regs {

	//用户名规则，不以下划线开头的，由字母数字下划线组成长度5-24
	String usernameReg = "^[^_][a-z0-9_]{5,24}$";

    /**
     * \d 数字：[0-9]
     \D 非数字： [^0-9]
     \s 空白字符：[ \t\n\x0B\f\r]
     \S 非空白字符：[^\s]
     \w 单词字符：[a-zA-Z_0-9]
     \W 非单词字符：[^\w]
     */
	//密码规则 6至16位非空字符
	String passwordReg = "^[^\\s]{6,16}$";  
	//==>2014.1.21
    String sjhmReg = "^13\\d{9}|15\\d{9}|18\\d{9}|17\\d{9}|147[0-9]{8}$";
    //<==2014.1.21
	String  dhhmReg= "^(?:0[0-9]{2,3}[-\\s]{1}|\\(0[0-9]{2,4}\\))[0-9]{6,8}$|^[1-9]{1}[0-9]{5,7}$|^[1-9]{1}[0-9]{10}$";

	String emailReg = "\\w+([-+.]\\w+)*@\\w+([-.]\\w+)*\\.\\w+([-.]\\w+)*";

	String yzbmReg = "[1-9]\\d{5}(?!\\d)";

	String IDCardReg = "((11|12|13|14|15|21|22|23|31|32|33|34|35|36|37|41|42|43|44|45|46|50|51|52|53|54|61|62|63|64|65|71|81|82|91)\\d{4})((((19|20)(([02468][048])|([13579][26]))0229))|((20[0-9][0-9])|(19[0-9][0-9]))((((0[1-9])|(1[0-2]))((0[1-9])|(1\\d)|(2[0-8])))|((((0[1,3-9])|(1[0-2]))(29|30))|(((0[13578])|(1[02]))31))))((\\d{3}(x|X))|(\\d{4}))";

	String hphmReg = "^[\\u4e00-\\u9fa5]{1}[A-Z0-9]{6}$";

	String clsbdhReg = "^[A-Z0-9]{17}|[0-9]{6}$";
	String clsbdhAndclsbdh6Reg = "^[A-Z0-9]{17}|[0-9]{6}$|^[A-Z0-9]{6}$";

	String clsbdh6Reg = "[A-Z0-9]{6}$";

	String dabhReg = "^[0-9]{12}$";

    //2014.4.15 只能输入汉字或英语的组合
    String nameReg="^[A-Za-z\\u4e00-\\u9fa5]+$";

}
